In [97]:
import pandas as pd
import numpy as np

In [98]:
df=pd.read_csv(r"C:\Users\admin\Desktop\Pandas\arjun srikant pandas\Titanic Data Competition\train.csv")

In [99]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [100]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [101]:
df.drop(columns=['PassengerId','Name','Ticket','Fare','Cabin','Embarked','SibSp','Parch'],axis=1,inplace=True)

In [102]:
df

     Survived  Pclass     Sex   Age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
886         0       2    male  27.0
887         1       1  female  19.0
888         0       3  female   NaN
889         1       1    male  26.0
890         0       3    male  32.0

[891 rows x 4 columns]

In [103]:
df.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
dtype: int64

In [104]:
from sklearn.preprocessing import OneHotEncoder

In [105]:
ohe=OneHotEncoder()

In [106]:
ohe.fit(df[["Sex"]])

OneHotEncoder()

In [107]:
ary1=ohe.transform(df[["Sex"]]).toarray()

In [108]:
ary1

array([[0., 1.],
       [1., 0.],
       [1., 0.],
       ...,
       [1., 0.],
       [0., 1.],
       [0., 1.]])

In [109]:
encode=pd.DataFrame(ary1,columns=["Female","Male"],)

In [110]:
encode

     Female  Male
0       0.0   1.0
1       1.0   0.0
2       1.0   0.0
3       1.0   0.0
4       0.0   1.0
..      ...   ...
886     0.0   1.0
887     1.0   0.0
888     1.0   0.0
889     0.0   1.0
890     0.0   1.0

[891 rows x 2 columns]

In [111]:
df=pd.concat([df,encode],axis=1)

In [112]:
df

     Survived  Pclass     Sex   Age  Female  Male
0           0       3    male  22.0     0.0   1.0
1           1       1  female  38.0     1.0   0.0
2           1       3  female  26.0     1.0   0.0
3           1       1  female  35.0     1.0   0.0
4           0       3    male  35.0     0.0   1.0
..        ...     ...     ...   ...     ...   ...
886         0       2    male  27.0     0.0   1.0
887         1       1  female  19.0     1.0   0.0
888         0       3  female   NaN     1.0   0.0
889         1       1    male  26.0     0.0   1.0
890         0       3    male  32.0     0.0   1.0

[891 rows x 6 columns]

In [113]:
df.drop(columns=["Female","Sex"],axis=1)

     Survived  Pclass   Age  Male
0           0       3  22.0   1.0
1           1       1  38.0   0.0
2           1       3  26.0   0.0
3           1       1  35.0   0.0
4           0       3  35.0   1.0
..        ...     ...   ...   ...
886         0       2  27.0   1.0
887         1       1  19.0   0.0
888         0       3   NaN   0.0
889         1       1  26.0   1.0
890         0       3  32.0   1.0

[891 rows x 4 columns]

In [114]:
df=df[["Male","Age","Pclass","Survived"]]

In [115]:
df

     Male   Age  Pclass  Survived
0     1.0  22.0       3         0
1     0.0  38.0       1         1
2     0.0  26.0       3         1
3     0.0  35.0       1         1
4     1.0  35.0       3         0
..    ...   ...     ...       ...
886   1.0  27.0       2         0
887   0.0  19.0       1         1
888   0.0   NaN       3         0
889   1.0  26.0       1         1
890   1.0  32.0       3         0

[891 rows x 4 columns]

In [116]:
from sklearn.impute import SimpleImputer

In [117]:
si=SimpleImputer()

In [118]:
si.fit(df[["Age"]])

SimpleImputer()

In [119]:
ary2=si.transform(df[["Age"]])

In [120]:
encode2=pd.DataFrame(ary2,columns=["New_Age"])

In [121]:
encode2

       New_Age
0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
..         ...
886  27.000000
887  19.000000
888  29.699118
889  26.000000
890  32.000000

[891 rows x 1 columns]

In [122]:
df=pd.concat([df,encode2],axis=1)

In [123]:
df

     Male   Age  Pclass  Survived    New_Age
0     1.0  22.0       3         0  22.000000
1     0.0  38.0       1         1  38.000000
2     0.0  26.0       3         1  26.000000
3     0.0  35.0       1         1  35.000000
4     1.0  35.0       3         0  35.000000
..    ...   ...     ...       ...        ...
886   1.0  27.0       2         0  27.000000
887   0.0  19.0       1         1  19.000000
888   0.0   NaN       3         0  29.699118
889   1.0  26.0       1         1  26.000000
890   1.0  32.0       3         0  32.000000

[891 rows x 5 columns]

In [124]:
df.drop("Age",axis=1,inplace=True)

In [125]:
df

     Male  Pclass  Survived    New_Age
0     1.0       3         0  22.000000
1     0.0       1         1  38.000000
2     0.0       3         1  26.000000
3     0.0       1         1  35.000000
4     1.0       3         0  35.000000
..    ...     ...       ...        ...
886   1.0       2         0  27.000000
887   0.0       1         1  19.000000
888   0.0       3         0  29.699118
889   1.0       1         1  26.000000
890   1.0       3         0  32.000000

[891 rows x 4 columns]

In [126]:
X=df.drop("Survived",axis=1)

In [127]:
y=df["Survived"]

In [128]:
from sklearn.model_selection import train_test_split

In [129]:
Xtrain,Xtest,ytrain,yest=train_test_split(X,y,test_size=0.20)

In [130]:
from sklearn.neighbors import KNeighborsClassifier

In [131]:
knc=KNeighborsClassifier()

In [132]:
knc

KNeighborsClassifier()

In [133]:
from sklearn.linear_model import LogisticRegression

In [134]:
lr=LogisticRegression()

In [135]:
lr

LogisticRegression()

In [136]:
algo=[lr,knc]

In [137]:
for i in algo:
    print(i)

LogisticRegression()
KNeighborsClassifier()

In [138]:
for z in algo:
    z.fit(Xtrain,ytrain)
    s=z.score(Xtest,yest)
    print(z,"Score ==",s)

LogisticRegression() Score == 0.8324022346368715
KNeighborsClassifier() Score == 0.7430167597765364

In [139]:
from sklearn.model_selection import KFold,cross_val_score

In [140]:
kf=KFold(n_splits=10)

In [142]:
lr_score=cross_val_score(lr,X,y,cv=kf)

In [144]:
lr_score.mean()

0.7912609238451935

In [146]:
knc_score=cross_val_score(knc,X,y,cv=kf)

In [147]:
knc_score.mean()

0.7655430711610487